---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType
source: html/fc966bf7-766a-f6ec-2afe-4d1c19876e65.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType

Defines fence visualization types for diagram settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleDiagramFenceType
```